old_projects/cylinders/kvadrylinder/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-8 -9 0) //0
    (-1.4142 -9 0) //1
    (1.4142 -9 0) //2
    (8 -9 0) //3
    (18 -9 0) //4
/////
    (-8 -1.4142 0) //5
    (-1.4142 -1.4142 0) //6
    (1.4142 -1.4142 0) //7
    (8 -1.4142 0) //8
    (18 -1.4142 0) //9
/////
    (-8 1.4142 0) //10
    (-1.4142 1.4142 0) //11
    (1.4142 1.4142 0) //12
    (8 1.4142 0) //13
    (18 1.4142 0) //14
/////
    (-8 9 0) //15
    (-1.4142 9 0) //16
    (1.4142 9 0) //17
    (8 9 0) //18
    (18 9 0) //19
/////
    (-0.707 -0.707 0) //20
    (0.707 -0.707 0) //21
    (-0.707 0.707 0) //22
    (0.707 0.707 0) //23
/////
/////hight
    (-8 -9 1) //24
    (-1.4142 -9 1) //25
    (1.4142 -9 1) //26
    (8 -9 1) //27
    (18 -9 1) //28
/////
    (-8 -1.4142 1) //29
    (-1.4142 -1.4142 1) //30
    (1.4142 -1.4142 1) //31
    (8 -1.4142 1) //32
    (18 -1.4142 1) //33
/////
    (-8 1.4142 1) //34
    (-1.4142 1.4142 1) //35
    (1.4142 1.4142 1) //36
    (8 1.4142 1) //37
    (18 1.4142 1) //38
/////
    (-8 9 1) //39
    (-1.4142 9 1) //40
    (1.4142 9 1) //41
    (8 9 1) //42
    (18 9 1) //43
/////
    (-0.707 -0.707 1) //44
    (0.707 -0.707 1) //45
    (-0.707 0.707 1) //46
    (0.707 0.707 1) //47
/////
/////
    (-18 -9 0) //48
    (-18 -1.4142 0)//49
    (-18 1.4142 0) //50
    (-18 9 0) //51
/////
    (-18 -9 1) //52
    (-18 -1.4142 1)//53
    (-18 1.4142 1) //54
    (-18 9 1) //55
);

blocks
(
hex (50 10 15 51 54 34 39 55) (38 43 1) simpleGrading (0.5 4.0 1.0) //ж слева верх
hex (49 5 10 50 53 29 34 54) (38 43 1) simpleGrading (0.5 1 1) //ж слева середина
hex (48 0 5 49 52 24 29 53) (38 43 1) simpleGrading (0.5 0.25 1.0) //ж слева низ
hex (13 14 19 18 37 38 43 42) (38 43 1) simpleGrading (2 4.0 1.0) //ж справа верх
hex (8 9 14 13 32 33 38 37) (38 43 1) simpleGrading (2 1 1)//ж справа середина
hex (3 4 9 8 27 28 33 32) (38 43 1) simpleGrading (2 0.25 1) //ж справа низ

hex (10 11 16 15 34 35 40 39) (38 43 1) simpleGrading (0.5 4.0 1) //з верх 1
hex (11 12 17 16 35 36 41 40) (38 43 1) simpleGrading (1 4.0 1) //з верх 2
hex (12 13 18 17 36 37 42 41) (38 43 1) simpleGrading (2 4.0 1) //з верх 3
hex (5 6 11 10 29 30 35 34) (38 43 1) simpleGrading (0.5 1 1) //з середина 1
hex (7 8 13 12 31 32 37 36) (38 43 1) simpleGrading (2 1 1) //з середина 2
hex (0 1 6 5 24 25 30 29) (38 43 1) simpleGrading (0.5 0.25 1) //з низ 1
hex (1 2 7 6 25 26 31 30) (38 43 1) simpleGrading (1 0.25 1)//з низ 2
hex (2 3 8 7 26 27 32 31) (38 43 1) simpleGrading (2 0.25 1)//з низ 3

hex (6 7 21 20 30 31 45 44) (38 40 1) simpleGrading (1 0.25 1.0) //круг
hex (21 7 12 23 45 31 36 47) (40 43 1) simpleGrading (4.0 1 1) //круг
hex (22 23 12 11 46 47 36 35) (38 40 1) simpleGrading (1.0 4.0 1.0) //круг
hex (6 20 22 11 30 44 46 35) (40 43 1) simpleGrading (0.25 1 1) //круг
);

edges
(

);

boundary
(
inlet
{
type patch;
faces
(
(48 52 53 49)
(49 53 54 50)
(50 54 55 51)
);
}
outlet
{
type patch;
faces
(
(4 28 33 9)
(9 33 38 14)
(14 38 43 19)
);
}
bottom
{
type patch;
faces
(
(48 52 24 0)
(0 24 25 1)
(1 25 26 2)
(2 26 27 3)
(3 27 28 4)
);
}
top
{
type patch;
faces
(
(51 55 39 15)
(15 39 40 16)
(16 40 41 17)
(17 41 42 18)
(18 42 43 19)
);
}
cylinder
{
type wall;
faces
(
(20 44 45 21)
(21 45 47 23)
(22 46 47 23)
(20 44 46 22)
);
}
);

mergePatchPairs
(
);

// ************************************************************************* //
