old_projects/cylinders/kvadrylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          129;
        startFace       58312;
    }
    outlet
    {
        type            patch;
        nFaces          129;
        startFace       58441;
    }
    bottom
    {
        type            patch;
        nFaces          190;
        startFace       58570;
    }
    top
    {
        type            patch;
        nFaces          190;
        startFace       58760;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          162;
        startFace       58950;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          58712;
        startFace       59112;
    }
)

// ************************************************************************* //
